Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/phpmyadmin-5-2.tmx
Source language: en
Languages: sv

source: LINUX ONLY: Launches an external application and feeds it the column data via standard input. Returns the standard output of the application. The default is Tidy, to pretty-print HTML code. For security reasons, you have to manually edit the file libraries/classes/Plugins/Transformations/Abs/ExternalTransformationsPlugin.php and list the tools you want to make available. The first option is then the number of the program you want to use. The second option should be blank for historical reasons. The third option, if set to 1, will convert the output using htmlspecialchars() (Default 1). The fourth option, if set to 1, will prevent wrapping and ensure that the output appears all on one line (Default 1).
sv: ENDAST LINUX: Startar ett externt program och skickar kolumndata till dess standardindata. Returnerar programmets standardutdata. Standardprogrammet är Tidy, som formaterar HTML-kod. Av säkerhetsskäl måste du manuellt redigera filen libraries/classes/Plugins/Transformations/Abs/ExternalTransformationsPlugin.php och lista verktygen som ska göras tillgängliga. Det första alternativet är numret på programmet som ska användas. Det andra ska av historiska skäl vara tomt. Det tredje alternativet konverterar utdata med htmlspecialchars() när det är 1 (standard: 1). Det fjärde förhindrar radbrytning och visar utdata på en rad när det är 1 (standard: 1).

source: Issue:
sv: Problem:

source: Update data when duplicate keys found on import
sv: Uppdatera data när dubblettnycklar hittas vid import

source: slow_query_log is set to 'OFF'
sv: slow_query_log är satt till 'OFF'

source: Control user
sv: Kontrollanvändare

source: The number of joins that did a full scan of the first table.
sv: Antalet kopplingar som gjorde en fullständig genomsökning av den första tabellen.

source: Output unicode characters unescaped
sv: Skriv ut Unicode-tecken utan escape-sekvenser

source: The ini_get and/or ini_set functions are disabled in php.ini. phpMyAdmin requires these functions!
sv: Funktionerna ini_get och/eller ini_set är inaktiverade i php.ini. phpMyAdmin kräver dessa funktioner.

source: This MySQL server works as <b>replica</b> in <b>replication</b> process.
sv: Den här MySQL-servern fungerar som <b>replik</b> i en <b>replikerings</b>process.

source: Icelandic
sv: Isländsk

source: Error.
sv: Fel.

source: Structure of %s
sv: Struktur för %s

source: Check privileges for database "%s".
sv: Kontrollera privilegier för databas "%s".

source: Formats text as JSON with syntax highlighting.
sv: Formaterar text som en JSON-fråga med syntaxmarkering.

source: Password
sv: Lösenord

source: Note: Setting these options to 0 (zero) removes the limit.
sv: Anm: Genom att sätta dessa alternativ till 0 (noll) tas begränsningarna bort.

source: Server connection:
sv: Serveranslutning:

source: Choose the default action when sending error reports.
sv: Välj standardhandling vid sändande av felrapporter.

source: Rows:
sv: Rader:

source: Partition table
sv: Partitionera tabell

source: Query result data
sv: Data i frågeresultat

source: Sum of grouped rows:
sv: Summan av grupperade rader:

source: Read misses in %
sv: Läsmissar i %

source: Invalid format of CSV input on line %d.
sv: Ogiltigt format i CSV-indata på rad %d.

source: File name template:
sv: Filnamnsmall:

source: Dirty pages
sv: Orena sidor

source: Enable statistics
sv: Aktivera Statistik

source: Find partial dependencies
sv: Hitta partiellt beroenden

source: Currently running Git revision %1$s from the %2$s branch.
sv: Kör nu Git version %1$s fron grenen %2$s.

source: If you did not compile from source, you may be using a package modified by a distribution. The MySQL manual only is accurate for official MySQL binaries, not any package distributions (such as RedHat, Debian/Ubuntu etc).
sv: Om du inte kompilerade från källkod, så kanske du använder ett paket som modifierats av en distribution. MySQL-handboken är endast exakt för officiella MySQL-binärer, inte någon distributions paket (t.ex. RedHat, Debian/Ubuntu etc).

source: Warnings
sv: Varningar

source: There are large item groups in navigation panel which may affect the performance. Consider disabling item grouping in the navigation panel.
sv: Det finns stora artikelgrupper i navigeringspanelen som kan påverka prestanda. Överväga att inaktivera objektgruppering i navigeringspanelen.

source: Range search
sv: Sökområde

source: Increase {max_connections}, or decrease {wait_timeout} so that connections that do not close database handlers properly get killed sooner. Make sure the code closes database handlers properly.
sv: Öka {max_connections} eller minska {wait_timeout} så att anslutningar som inte stänger databashanterare blir dödade tidigare. Se till att koden stänger databashanteraren ordentligt.

source: How to use
sv: Hur du använder

source: Area
sv: Ytdiagram

source: Host name
sv: Värdnamn

source: Tables display options.
sv: Visningsalternativ för tabeller.

source: If the data in each row of the file is not in the same order as in the database, list the corresponding column names here. Column names must be separated by commas and not enclosed in quotations.
sv: Om uppgifterna i varje rad i filen är inte i samma ordning som i databasen, lista motsvarande kolumnnamn här. Kolumnnamn måste vara åtskilda med kommatecken och inte inneslutna i citattecken.

source: Export of trigger %s
sv: Exportera trigger %s

source: per minute:
sv: per minut:

source: Limits the number of commands that change any table or database the user may execute per hour.
sv: Begränsar antalet kommandon, vilka ändrar någon tabell eller databas, som användaren kan utföra per timme.

source: Estonian
sv: Estnisk

source: Drop files here
sv: Släpp filer här

source: Use tables
sv: Använd tabeller

source: Do you really want to execute the following query?
sv: Vill du verkligen exekvera följande fråga?

source: Slow query logging
sv: Långsam frågeloggning

source: Re-login to phpMyAdmin to load the updated configuration file.
sv: Logga in igen till phpMyAdmin för att ladda den uppdaterade konfigurationsfilen.

source: both of the above
sv: båda av ovanstående

source: Allow to display all the rows
sv: Tillåt att visa alla rader

source: Use OpenStreetMaps as Base Layer
sv: Använd OpenStreetMaps som baslager

source: The number of requests to read the previous row in key order. This read method is mainly used to optimize ORDER BY … DESC.
sv: Antalet efterfrågningar att läsa den föregående raden i nyckelordning. Denna läsmetod används huvudsakligen för att optimera ORDER BY … DESC.

source: -- None --
sv: -- Inget --

source: Two-factor authentication is not available, please install optional dependencies to enable authentication backends.
sv: Tvåfaktorsautentisering är inte tillgänglig. Installera valfria beroenden för att aktivera autentiseringsbakändar.

source: Text fields
sv: Textfält

source: Optimize queries and/or use InnoDB to reduce lock wait.
sv: Optimera frågor och/eller använd InnoDB för att minska låsningsväntan.

source: A compressed file's name must end in <strong>.[format].[compression]</strong>. Example: <strong>.sql.zip</strong>
sv: En komprimerad fils namn måste sluta med <strong>.[format].[komprimering]</strong>. Exempel: <strong>.sql.zip</strong>

source: The passwords aren't the same!
sv: Lösenorden överensstämmer inte!

source: Display relational schema
sv: Visa relationsschema

source: Minimum size for input field
sv: Minsta storlek för inmatningsfält

source: No Transitive dependencies possible as the table doesn't have any non primary key columns
sv: Inga transitiva beroenden möjliga, eftersom tabellen inte har någon icke primära nyckelkolumner

source: Foreign key constraint %s has been dropped
sv: Främmande nyckel-begränsning %s har tagits bort

source: Ignore
sv: Ignorera

source: Sorry an unexpected error happened!
sv: Ett oväntat fel inträffade.

source: Default
sv: Standardvärde

source: Go to link:
sv: Gå till länk:

source: Let the server run for a longer time until it has executed a greater amount of queries.
sv: Låt servern köra under en längre tid tills den har utfört en större mängd frågor.

source: Words are separated by a space character (" ").
sv: Ord separeras av ett mellanslag (" ").

source: Untitled
sv: Namnlöst

source: Documentation and further information about PBXT can be found on the %sPrimeBase XT Home Page%s.
sv: Dokumentation och ytterligare information finns på %sPrimeBase XT Home Page%s.

source: X-Axis:
sv: X-axel:

source: Affected rows:
sv: Påverkade rader:

source: Versions
sv: Versioner

source: Series names are in a column
sv: Serie namn är i en kolumn

source: Database %1$s has been copied to %2$s.
sv: Databasen %1$s har kopierats till %2$s.

source: Or:
sv: Eller:

source: Show creation timestamp
sv: Visa skapad tidpunkt

source: Show create database form
sv: Visa skapa databas-formulär

source: This option will replace your table and contained data.
sv: Denna alternativ kommer att ersätta din tabell och ingående data.

source: Function
sv: Funktion

source: You probably did not create a configuration file. You might want to use the %1$ssetup script%2$s to create one.
sv: Du har troligen inte skapat en konfigurationsfil. Du vill kanske använda %1$suppsättningsskript%2$s för att skapa denna.

source: The database name is not known for this query in the server's logs.
sv: Databasnamnet är inte känt för denna fråga i serverns loggar.

source: May be approximate. Click on the number to get the exact count. See [doc@faq3-11]FAQ 3.11[/doc].
sv: Kan vara ungefärliga. Klicka på numret för att få exakt siffra. Se [doc@faq3-11] FAQ 3.11 [/doc].

source: Optimize
sv: Optimera

source: Browse mode
sv: Utforskningsläge

source: Importing into the database "%s"
sv: Importera till databasen "%s "

source: If this value is greater than 1, MyISAM table indexes are created in parallel (each index in its own thread) during the repair by sorting process.
sv: Om detta värde är större än 1 skapas MyISAM-tabellindex parallellt (varje index i sin egen tråd) under reparationen vid sorteringsprocess.

source: New name
sv: Nytt namn

source: %d minutes
sv: %d minuter

source: Take it
sv: Använd det

source: An error has been detected and an error report has been automatically submitted based on your settings.
sv: Ett fel har upptäckts och en felrapport har skickats automatiskt i enlighet med dina inställningar.

source: Query statistics
sv: Visa statistik

source: Angular links
sv: Vinklade länkar

source: Could not load export plugins, please check your installation!
sv: Kunde inte läsa in insticksprogram för export. Kontrollera din installation!

source: Group items in the navigation tree (determined by the separator defined in the Databases and Tables tabs above).
sv: Grupperar objekt i navigationsträdet (bestäms av avskiljaren definierad i databas- & tabell-flikarna).

source: Czech-Slovak
sv: Tjeckisk-slovakisk

source: Error: Token mismatch
sv: Fel: Token matchningsfel

source: Size
sv: Storlek

source: Enter your private key for your domain reCAPTCHA service.
sv: Ange din privata nyckel för domänens reCAPTCHA-tjänst.

source: Allow users to customize this value
sv: Tillåt användare att anpassa detta värde

source: Only replicas started with the --report-host=host_name option are visible in this list.
sv: Endast repliker som startats med alternativet --report-host=host_name visas i den här listan.

source: The MySQL manual only is accurate for official MySQL binaries.
sv: MySQL-handboken är endast korrekt för officiella MySQL-binärer.

source: The row has been deleted.
sv: Raden har raderats.

source: Save edited data
sv: Spara editerade data

source: Put columns names in the first row:
sv: Sätt kolumnnamn på första raden:

source: AUTO_INCREMENT for dumped tables
sv: AUTO_INCREMENT för dumpade tabeller

source: Revoke all active privileges from the users and delete them afterwards.
sv: Upphäv alla aktiva privilegier från användarna och ta bort dem efteråt.

source: Leave blank for no SQL query tracking support, suggested: [kbd]pma__tracking[/kbd].
sv: Lämna tomt för avstängt stöd för SQL-frågespårning, förslag: [kbd]pma__tracking[/kbd].

source: Show:
sv: Visa:

source: Signon URL
sv: Inloggnings-URL

source: Maximal number of table preferences to store
sv: Maximalt antal tabellinställningar att spara

source: Ins
sv: Infoga

source: Your InnoDB log size is at %s%% in relation to the InnoDB buffer pool size, it should not be below 20%%
sv: Din InnoDB-loggstorlek är %s%%, i förhållande till InnoDB buffer pool storlek, bör det inte vara under 20%%

source: General relation features
sv: Allmänna relationsfunktionaliteter

source: File uploads are not allowed on this server.
sv: Uppladdning är inte tillåten på denna server.

source: Columns escaped with:
sv: Specialtecken i fält föregås av:

source: The increment size for extending the size of an autoextending tablespace when it becomes full.
sv: Tillökningsstorleken vid automatisk utökning av tabellutrymme när det blir fullt.

source: Step 1.
sv: Steg 1.

source: Please note that enabling this has no effect with [kbd]config[/kbd] authentication mode because the password is hard coded in the configuration file; this does not limit the ability to execute the same command directly.
sv: Observera att aktivering av detta har ingen inverkan på [kbd]config[/kbd]-autentisering eftersom lösenordet är hårdkodat i konfigurationsfilen; detta begränsar inte möjligheten att utföra samma kommando direkt.

source: [kbd]SMART[/kbd] - i.e. descending order for columns of type TIME, DATE, DATETIME and TIMESTAMP, ascending order otherwise.
sv: [kbd]SMART[/kbd] - dvs fallande ordning för kolumner av typen TIME, DATE, DATETIME och TIMESTAMP, stigande ordning annars.

source: Use LOCAL keyword
sv: Använd nyckelordet LOCAL

source: The %s functionality is affected by a known bug, see %s
sv: Funktionaliteten för %s påverkas av en känd bugg, se %s

source: The number of temporary tables currently open by the replica SQL thread.
sv: Antalet temporära tabeller som för närvarande är öppna av replikens SQL-tråd.

source: Leave blank for no "persistent" favorite tables across sessions, suggested: [kbd]pma__favorite[/kbd].
sv: Lämna tom för inga favorittabeller över sessioner, förslag: [kbd] pma__favorite [/kbd].

source: Sorry, we failed to restore the dropped event.
sv: Tyvärr kunde vi inte återställa tappade händelsen.

source: Delete tracking data for these tables?
sv: Ta bort uppföljningsdata för dessa tabeller?

source: query_cache_size is set to 0 or query_cache_type is set to 'OFF'
sv: query_cache_size är satt till 0 eller query_cache_type är inställd på 'OFF'

source: Highlight selected rows.
sv: Markera valda rader.

source: Username:
sv: Användarnamn:

source: Restore default value
sv: Återställ standardvärde

source: Git revision:
sv: Git version:

source: This host
sv: Denna värd

source: Help
sv: Hjälp

source: Could not load import plugins, please check your installation!
sv: Kunde inte läsa in insticksprogram för import, kontrollera din installation!

source: Foreign key constraints
sv: Begränsningar av främmande nyckel

source: A user account allowing any user from localhost to connect is present. This will prevent other users from connecting if the host part of their account allows a connection from any (%) host.
sv: Ett användarkonto som tillåter alla användare från localhost att ansluta är tillgängligt. Detta kommer att hindra andra användare från att ansluta om värddelen av deras konto tillåter anslutning från alla värddatorer (%).

source: Grant all privileges on database %s.
sv: Bevilja alla behörigheter för databasen ”%s”.

source: Search this table
sv: Sök i denna tabell

source: Add table prefix
sv: Lägg till tabellprefix

source: Select referenced key
sv: Välj refererad nyckel

source: An internal relation is not necessary when a corresponding FOREIGN KEY relation exists.
sv: En intern relation är inte nödvändig när en motsvarande främmande nyckel relation finns.

source: Columns
sv: Kolumn

source: Query
sv: Fråga

source: A small floating-point number, allowable values are -3.402823466E+38 to -1.175494351E-38, 0, and 1.175494351E-38 to 3.402823466E+38
sv: Ett litet flyttal. Tillåtna värden är: 3.402823466E+38 till-1.175494351E-38, 0, och 1.175494351E-38 till 3.402823466E+38

source: Export type
sv: Export-typ

source: No accounts selected.
sv: Inga konton valda.

source: Leave blank for no "persistent" tables' UI preferences across sessions, suggested: [kbd]pma__table_uiprefs[/kbd].
sv: Lämna tomt för att stänga av "ihållande" tabellers användargränssnittspreferenser som sparas över sessioner, förslag: [kbd]pma__table_uiprefs[/kbd].

source: Exporting databases from the current server
sv: Exportera databaser från den aktuella servern

source: The number of joins that used ranges on the first table. (It's normally not critical even if this is big.)
sv: Antalet kopplingar som använde urval på den första tabellen. (Det är normalt inte kritiskt även om detta är stort.)

source: Chart arrangement
sv: Diagramarrangemang

source: The event was dropped immediately after creation.
sv: Händelsen kasserades omedelbart efter att den skapades.

source: An alternate host to hold the configuration storage; leave blank to use the already defined host.
sv: En alternativ värd för att hålla konfigurationslagring, lämna tomt för att använda den aktuella värden.

source: Add privileges on the following database(s):
sv: Lägg till privilegier till följande databas(er):

source: The InnoDB log file size is inadequately large.
sv: Storleken på InnoDB databas är inte tillräckligt stor.

source: Empty phpMyAdmin control user password while using phpMyAdmin configuration storage!
sv: Tomt lösenord för phpMyAdmin-kontrollanvändare vid användning av konfigurationslagring för phpMyAdmin!

source: Users table
sv: Användartabell

source: Update
sv: Uppdatera

source: Ignore all databases; Replicate:
sv: Ignorera alla databaser; Replikera:

source: Slovak
sv: Slovakisk

source: There was a problem accessing your browser storage, some features may not work properly for you. It is likely that the browser doesn't support storage or the quota limit has been reached. In Firefox, corrupted storage can also cause such a problem, clearing your "Offline Website Data" might help. In Safari, such problem is commonly caused by "Private Mode Browsing".
sv: Det gick inte att komma åt din webbläsares lokala lagring, vissa funktioner kanske inte fungerar som de ska för dig. Det är sannolikt att din webbläsare inte har stöd för lagring eller att kvoten för densamma är fylld. I Firefox kan korrupt lagring orsaka dylika problem, att rensa "Nedkopplad lagring av webbinnehåll och användardata" kan hjälpa. I Safari orsakas dylika problem oftast av "Privat läge".

source: Export the data of all tables.
sv: Exportera data från alla tabeller.

source: Default transformations for DateFormat
sv: Standardomvandlingar för DateFormat

source: No trigger with name %1$s found in database %2$s.
sv: Ingen trigger med namnet %1$s hittades i databasen %2$s.

source: Changing charset
sv: Ändrar teckenuppsättning

source: Not enough privilege to view query statistics.
sv: Inte tillräcklig behörighet för att visa fråge-statistik.

source: Show panel
sv: Visa panel

source: Filter
sv: Filtrera

source: Add an inner ring
sv: Lägg till ny inre ring

source: Maximum tables
sv: Maximalt antal tabeller

source: If column type is "enum" or "set", please enter the values using this format: 'a','b','c'…<br>If you ever need to put a backslash ("\") or a single quote ("'") amongst those values, precede it with a backslash (for example '\\xyz' or 'a\'b').
sv: Om en fälttyp är "enum" eller "set", ange värden enligt följande format: 'a','b','c'…<br>Om du behöver lägga till ett backslash ("\") eller ett enkelcitat ("'") i värdena, skriv ett backslash före tecknet (t.ex. '\\xyz' eller 'a\'b').

source: Uptime below one day
sv: Upptid mindre än en dag

source: Enable SSL for connection to MySQL server.
sv: Aktivera SSL för anslutning till MySQL-servern.

source: disabled
sv: inaktiverad

source: Move Menu
sv: Flytta meny

source: Type to filter these, Enter to search all
sv: Skriv för att filtrera, Retur för att söka i alla

source: The name of the primary key must be "PRIMARY"!
sv: Primärnyckelns namn måste vara "PRIMARY"!

source: Query cache low memory prunes
sv: Fråge cachen lite minne prunes

source: %sZip compression%s requires functions (%s) which are unavailable on this system.
sv: %sZip kompression%s kräver funktioner (%s) som inte är tillgängliga på detta system.

source: Make sure you have a unique server-id in your configuration file (my.cnf). If not, please add the following line into [mysqld] section:
sv: Säkerställ att du har unikt server-id i din konfigurationsfil (my.cnf). Om inte, lägg till följande rad i [mysqld]-sektionen:

source: No users were found belonging to this user group.
sv: Inga användare tillhörde denna användargrupp.

source: Maximum number of recently used tables; set 0 to disable.
sv: Maximalt antal nyligen använda tabeller, ange 0 för att inaktivera.

source: %1$d row affected.
sv: %1$d rad påverkad.

source: %1$d rows affected.
sv: %1$d rader påverkade.

source: Whether to offer the possibility of tree expansion in the navigation panel.
sv: Möjliggör trädexpansion i navigationspanelen.

source: No change
sv: Ingen förändring

source: Change or reconfigure primary server
sv: Ändra eller konfigurera om primärserver

source: Tracking statements
sv: Spårning av uppgifter

source: You didn't have blowfish secret set and have enabled [kbd]cookie[/kbd] authentication, so a key was automatically generated for you. It is used to encrypt cookies; you don't need to remember it.
sv: Du hade inte blowfish-säkerhet angivet och hade aktiverat [kbd]cookie[/kbd]-autentisering, så en nyckel genererades automatiskt åt dig. Den används för att kryptera cookies; du behöver inte komma ihåg den.

source: Unable to change primary!
sv: Det går inte att ändra primärserver!

source: Remove database
sv: Radera databasen

source: Display comments
sv: Visa kommentarer

source: If the temporary file used for fast MyISAM index creation would be larger than using the key cache by the amount specified here, prefer the key cache method.
sv: Om den temporära filen som används för snabbt skapande av MyISAM-index skulle vara större än att använda nyckelcachen vars storlek specificeras här, så föredras metoden med nyckelcachen.

source: Content-Security-Policy snippet for reCAPTCHA v2 API
sv: Content-Security-Policy-snutt för reCAPTCHA v2-API

source: Search this list
sv: Sök i denna lista

source: Server charset:
sv: Serverns teckenuppsättning:

source: Home
sv: Hem

source: Database-specific privileges
sv: Databasspecifika privilegier

source: Chart columns
sv: Visa kolumner

source: Leave blank for no [doc@relations@]relation-links[/doc] support, suggested: [kbd]pma__relation[/kbd].
sv: Lämna tomt för avstängt stöd för [doc@relations@]relationslänkar[/doc], förslag: [kbd]pma__relation[/kbd].

source: Display the function fields in edit/insert mode.
sv: Visa funktionsfälten i ändra/infoga-läge.

source: Add a new server
sv: Lägg till en ny server

source: Ignore errors
sv: Ignorera fel

source: Name of the new database (optional):
sv: Namn på den nya databasen (valfritt):

source: Buffer Pool Activity
sv: Buffertpool-aktivitet

source: Database used for relations, bookmarks, and PDF features. See [doc@linked-tables]pmadb[/doc] for complete information. Leave blank for no support. Suggested: [kbd]phpmyadmin[/kbd].
sv: Databas som används för relationer, bokmärken och PDF-funktioner. Se [doc@linked-tables]pmadb[/doc] för komplett information. Lämna tomt för inget stöd. Förslag: [kbd]phpmyadmin[/kbd].
